test/piping_in_gap_graded_soil/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.01;

vertices
(
  (2.828427    2.828427    0)    // 0
  (-2.828427    2.828427    0)   // 1
  (-2.828427    -2.828427    0)  // 2
  (2.828427    -2.828427    0)   // 3
  (1.8     1.8     0)          // 4
  (-1.8     1.8     0)         // 5
  (-1.8     -1.8     0)        // 6
  (1.8     -1.8     0)         // 7
  (2.828427    2.828427    20)    // 8
  (-2.828427    2.828427    20)   // 9
  (-2.828427    -2.828427    20)  // 10
  (2.828427    -2.828427    20)   // 11
  (1.8     1.8     20)          // 12
  (-1.8     1.8     20)         // 13
  (-1.8     -1.8     20)        // 14
  (1.8     -1.8     20)         // 15
);

blocks
(
  hex (4 5 6 7 12 13 14 15) (30 30 180) simpleGrading (1 1 1)
  hex (0 1 5 4 8 9 13 12) (30 20 180) simpleGrading (1 1.5 1)
  hex (1 2 6 5 9 10 14 13) (30 20 180) simpleGrading (1 1.5 1)
  hex (2 3 7 6 10 11 15 14) (30 20 180) simpleGrading (1 1.5 1)
  hex (3 0 4 7 11 8 12 15) (30 20 180) simpleGrading (1 1.5 1)
  /*
  hex (4 5 6 7 12 13 14 15) (20 20 120) simpleGrading (1 1 1)
  hex (0 1 5 4 8 9 13 12) (20 15 120) simpleGrading (1 1.5 1)
  hex (1 2 6 5 9 10 14 13) (20 15 120) simpleGrading (1 1.5 1)
  hex (2 3 7 6 10 11 15 14) (20 15 120) simpleGrading (1 1.5 1)
  hex (3 0 4 7 11 8 12 15) (20 15 120) simpleGrading (1 1.5 1)
   */
);

edges
(
  arc 0 1 (0 4.0 0)    // e0
  arc 1 2 (-4.0 0 0)   // e1
  arc 2 3 (0 -4.0 0)   // e2
  arc 3 0 (4.0 0 0)    // e3
  arc 8 9 (0 4.0 20.0)    // e4
  arc 9 10 (-4.0 0 20.0)  // e5
  arc 10 11 (0 -4.0 20.0) // e6
  arc 11 8 (4.0 0 20.0)  // e7
);

patches
(
  wall inlet
  (
    (4 5 6 7)
    (0 1 5 4)
    (1 2 6 5)
    (2 3 7 6)
    (3 0 4 7)
  )
  wall walls
  (
    (0 8 9 1)
    (1 9 10 2)
    (2 10 11 3)
    (3 11 8 0)
  )
  wall outlet
  (
    (12 13 14 15)
    (8 9 13 12)
    (9 10 14 13)
    (10 11 15 14)
    (11 8 12 15)
  )
);
